---
kind: other
id: Properties.T:Autodesk.Revit.DB.SpatialElementGeometryResults
source: html/18b1cb30-61a3-7173-3b24-5129e6d817f9.htm
---
# SpatialElementGeometryResults Properties

Specifies whether the .NET object represents a valid Revit entity.